Feature: 회원정보 관리
  Daum의 내 정보를 정확하게 유지하기 위해,
  나는 다음 사용자로써 회원 정보를 변경한다.

  Background:
    Given 로그인한 상태이다

  Scenario: 회원정보 > 내 기본 정보 수정을 한다
    Given 회원정보 정보 변경 페이지에 접속한다
    When 내 정보를 수정한다
    Then 변경완료 화면에서 "설정하신 정보로 변경이 완료되었습니다." 확인한다

  Scenario: 회원정보 > 내 메일정보 수정을 한다
    Given 회원정보 정보 변경 페이지에 접속한다
    When 내 메일정보를 수정한다
    Then 변경완료 화면에서 "설정하신 정보로 변경이 완료되었습니다." 확인한다

  Scenario: 회원정보 > 내 정보보호 수정을 한다
    Given 회원정보 정보 변경 페이지에 접속한다
    When 내 정보보호를 수정한다
    Then 변경완료 화면에서 "설정하신 정보로 변경이 완료되었습니다." 확인한다



